Revit 2024 API
IPerformanceAdviserRule.WillCheckElements Method
 Reports if rule needs to be executed on individual elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
bool WillCheckElements()
Visual Basic
Function WillCheckElements As Boolean
Visual C++
bool WillCheckElements()
Return Value
 True if rule needs to be executed on individual elements.
See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace